// // задание 1 

// let a = 10;
// alert(a);
// a = 20;
// alert(a);

// // задание 2 

// const iPhone = 2007;
// alert(iPhone);

// // задание 3

// const name = "Brendan Eich";
// alert(name);

// // задание 4

// let b = 10;
// let c = 2;
// alert(b + c);
// alert(b - c);
// alert(b * c);
// alert(b / c);

// // задание 5

// let result = 2 ** 5;
// alert(result);

// // задание 6

// let d = 9;
// let e = 2;
// alert(d % e);

// // задание 7

// let num = 1;
// num += 5;
// num -= 3;
// num *= 7;
// num /= 3;
// num++;
// num--;

// alert(num);

// // задание 8

// let age = prompt("Сколько вам лет?");
// alert(age);

// // задание 9

// const user = {
//     name: 'Andrew',
//     age: 100,
//     isAdmin: true
// };

// // задание 10 

// let userName = prompt("Назови свое имя?");
// alert(`Привет, ${userName}`);




// Задания на работу с кодом
// Задание 1
// Создайте программу проверки правильности введенного пароля по следующему алгоритму:

// Создайте переменную «пароль» и присвойте ей произвольный текст-пароль.
// (let password = 'пароль';)

// Создайте вторую переменную и с помощью 
// prompt()
//  спросить у пользователя «Введите пароль».
// Добавьте проверку: если пользователь вводит верный пароль, вывести на экран «Пароль введен верно».
// Добавьте проверку: если пользователь вводит неверный пароль, вывести на экран "Пароль введен неправильно".

let password = "world";
let safe = prompt("Введите пароль");

if (safe.toLowerCase() === password) {
    console.log ("Пароль введен верно");
} else {
    console.log ("Пароль введен неправильно");
}

// Задание 2
// Создайте переменную 
// с
//  и запишите в нее любое число. Если 
// с
//  больше 
// 0
//  и меньше 
// 10
// , то выведите в консоль «Верно», иначе выведите «Неверно».

// Проверьте работу скрипта при значении переменной 
// c
// , равной 
// 0
// , 
// 10
// , 
// −3
// , 
// 2
// .

// Для решения задачи используйте логический оператор 
// &&
//  (логическое И).

let c = prompt("Напиши число");

if (c > 0 && c < 10) {
    console.log("Верно");
} else {
     console.log("Неверно");
}

// Задание 3
// Создайте две переменные — 
// d
//  и 
// e
// , запишите в них любые числа.

// Если одна из переменных больше 
// 100
// , выведите в консоль «Верно», иначе выведите «Неверно».

// Для решения задачи используйте логический оператор 
// ||
//  (логическое ИЛИ).

// let d = Number(prompt("Запиши первое число"));
// let e = Number(prompt("Запиши второе число"));

if (d > 100 || e > 100) {
    console.log("верно");
} else {
    console.log("неверно");
}

// Задание 4
// Исправьте код с помощью преобразования типов, чтобы на экран выводилось число 
// 5
// , а не строка 
// '23'
// .

// let a = '2';
// let b = '3';
// // Код выше изменять менять нельзя. Чтобы решить задачу исправьте код ниже:
// alert(a + b);

let a = '2';
let b = '3';

alert(Number(a) + Number(b));

// Задание 5
// Напишите программу, которая определяет по номеру месяца в году, к какому сезону этот месяц принадлежит. Например,
//  1-й месяц (он же январь) принадлежит к сезону «зима».

// Для написания программы используйте оператор 
// switch
// . Для обозначения номера месяца используйте переменную 
// monthNumber
// , которая равна 
// 12
// . Пропишите условие, при котором программа не будет выполняться (номер месяца больше 13).

let monthNumber = Number(prompt("Напиши номер месяца"));

switch (monthNumber) {
    case 1:
        console.log("зима");
        break;
    case 2:
        console.log("зима");
        break;
    case 3:
        console.log("весна");
        break;
    case 4:
        console.log("весна");
        break;
    case 5:
        console.log("весна");
        break;
    case 6:
        console.log("лето");
        break;
    case 7:
        console.log("лето");
        break;
    case 8:
        console.log("лето");
        break;
    case 9:
        console.log("осень");
        break;
    case 10:
        console.log("осень");
        break;
    case 11:
        console.log("осень");
        break;
    case 12:
        console.log("зима");
        break;
   
    default:
        console.log('В году 12 месяцев!');    
}