// Задание 1

// Напишите функцию, которая возвращает меньшее из двух чисел.
// Например, из двух чисел — 
// 8
//  и 
// 4
//  — функция должна вернуть значение 
// 4
// . Если мы передаем два одинаковых значения, например 
// 6
//  и 
// 6
// , то функция должна вернуть это значение (в данном случае — 
// 6
// ).

function min(a, b) {
    if (a < b) {
        return a;
    } else {
        return b;
    }
}

console.log(min(8, 4));


// Задание 2
// Напишите функцию, которая принимает число и возвращает:
// строку 
// 'Число четное'
// , если число четное;
// строку 
// 'Число нечетное'
// , если число нечетное.
// Подсказка: четность проверяется с помощью условия 
// n % 2 == 0
// .

function isEven(number) {
    if (number % 2 === 0) {
        return 'Число четное';
    } else {
        return 'Число нечетное';
    }
}

console.log(isEven(4));


// Задание 3
// Напишите функцию, которая принимает параметром число и выводит в консоль квадрат этого числа.
// Напишите функцию, которая принимает параметром число и возвращает квадрат этого числа значением — так, 
// чтобы потом это значение можно было использовать.

function squarings(c) {
    console.log(c ** 2);
}

squarings(3)

function squaring(c) {
    return c ** 2;
}

console.log(squaring(6))



// Задание 4
// Создайте функцию, которая:

// Спрашивает у пользователя, сколько ему лет.
// Если пользователь введет отрицательное число — возвращает
// 'Вы ввели неправильное значение'
// .
// Если пользователь введет число от
// 0
//  до
// 12
//  — возвращает
// 'Привет, друг!'
// .
// Если пользователь введет число больше или равно
// 13
//  — возвращает
// 'Добро пожаловать!'
// .
// Для проверки вывода можете вызвать функцию в
// alert
// . Например,
// alert(correctAge(prompt("Сколько вам лет?")))

// Подсказка: можете выполнить это задание с помощью оператора
// if else
// .

function userName() {
    let age = prompt("Сколько тебе лет?");
    if (age <= 12 && age >= 0) {
        return ('Привет, друг!');
    } else if (age >= 13) {
        return ('Добро пожаловать!');
    } else {
        return ('Вы ввели неправильное значение');
    }
}

alert(userName());

// Задание 5
// Напишите функцию, которая принимает на вход два числа, а далее следует алгоритму:

// Проверяет, являются ли переданные параметры корректными числами.
// Подсказка: используйте преобразование типов и
// isNaN()
// .

// Если нет — возвращает строку
// 'Одно или оба значения не являются числом'
// .
// Если оба параметра — числа, то возвращает произведение данных чисел.


function numericCheck(a, b) {
    if (typeof a === 'number' && !isNaN(a) && typeof b === 'number' && !isNaN(b)) {
        return a * b;
    } else {
        return 'Одно или оба значения не являются числом';
    }
}

alert(numericCheck("4", 5)); 


// Задание 6
// Напишите функцию, которая выполняет следующий алгоритм:

// Запрашивает у пользователя число.
// Проверяет, является ли введенное значение числом.
// Если значение не является числом, возвращает строку
// 'Переданный параметр не является числом'
// .
// Если значение является числом, возвращает строку
// 'n в кубе равняется <получившееся значение>'
// , где
// n
//  — введенное число, а
// <получившееся значение>
//  — число, возведенное в куб.
// Проверьте работу функции с числами от
// 0
//  до
// 10
// .


function operationsWithNumbers() {
    let n = prompt("Введите число:");
    if (isNaN(n)) {
        return 'Переданный параметр не является числом';
    } else {
        let result = n ** 3;
        return 'n в кубе равняется ' + result;
    }
}

alert(operationsWithNumbers())

let i = 0;
while (i <= 10) {
    console.log('n в кубе равняется ' + (i ** 3));
    i++;
}


// Задание 7
// Создайте два объекта,
// circle1
//  и
// circle2
// , каждый из которых имеет свойство
// radius
// .

// Оба объекта должны иметь:

// Метод
// getArea
// , который возвращает площадь круга, вычисляемую через радиус.
// Метод
// getPerimeter
// , который возвращает периметр окружности.

function getArea() {
    return 3.14 * this.radius ** 2;
}
function getPerimeter() {
    return 2 * 3.14 * this.radius;
}

const circle1 = {
    radius: 5,
    getArea: getArea,
    getPerimeter: getPerimeter
};

const circle2 = {
    radius: 10,
    getArea: getArea,
    getPerimeter: getPerimeter
};


console.log(circle1.getArea());
console.log(circle1.getPerimeter());
console.log(circle2.getArea());
console.log(circle2.getPerimeter());


